<a href="https://colab.research.google.com/github/rajivsam/cmi_count_data_modeling/blob/asif_ikbal_21_07_2021/create_timeData_csv.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [72]:
import pandas as pd
import numpy as np

In [73]:
path='https://archive.ics.uci.edu/ml/machine-learning-databases/00352/Online%20Retail.xlsx'
data=pd.read_excel(path)

  InvoiceNo StockCode  ... CustomerID         Country
0    536365    85123A  ...    17850.0  United Kingdom
1    536365     71053  ...    17850.0  United Kingdom
2    536365    84406B  ...    17850.0  United Kingdom
3    536365    84029G  ...    17850.0  United Kingdom
4    536365    84029E  ...    17850.0  United Kingdom

[5 rows x 8 columns]

In [75]:
data['Date']=[d.date() for d in data['InvoiceDate']]
data['Hour']=[d.hour for d in data['InvoiceDate']]

In [76]:
dateTime=data[['Date','Hour']]

         Date  Hour
0  2010-12-01     8
1  2010-12-01     8
2  2010-12-01     8
3  2010-12-01     8
4  2010-12-01     8

Try this-
Make a dataframe with column names- Date,0,1,2,...,22,23.

For a unique date in dateTime, count number of occurance of 0,1,... etc.

              Date  Hour
1109    2010-12-01    13
1110    2010-12-01    13
1111    2010-12-01    13
1112    2010-12-01    13
1113    2010-12-01    13
...            ...   ...
540272  2011-12-08    20
540273  2011-12-08    20
540274  2011-12-08    20
540275  2011-12-08    20
540276  2011-12-08    20

[312824 rows x 2 columns]

559     96
560    105
561    152
562    102
563    167
564    136
565     48
566    166
567      1
568     78
569    374
Name: 0, dtype: int64

In [80]:
table=dateTime.groupby(['Date','Hour']).size()

In [81]:
tab2=pd.DataFrame(table.reset_index())

In [92]:
colNames=['Date']
colNames.extend([k for k in range(24)])
newDf=pd.DataFrame(columns=colNames)
for date in set(tab2['Date']):
  tab3=tab2[tab2['Date']==date][['Hour',0]]
  newRow=[date]
  newRow.extend([0 for k in range(24)])
  for hr in tab3['Hour']:
    newRow[int(hr)+1]=int(tab3[tab3['Hour']==hr][0])
  #print(pd.DataFrame([newRow],columns=colNames))
  newDf=newDf.append(pd.DataFrame([newRow],columns=colNames),ignore_index=True)

In [95]:
newDf.to_csv('timeData.csv')